sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
        }

    } else {
        Logger_error(F("Failed to load WiFi configuration"));
    }

}

#if ENABLE_DEEP_SLEEP


uint32_t DeepSleep::DeepSleepParams_t::getDeepSleepMaxMillis()
{
    return (_deepSleepMaxTime == 0) ? (ESP.deepSleepMax() * 9ULL / 10000ULL) : _deepSleepMaxTime;
}

void DeepSleep::DeepSleepParams_t::setDeepSleepMaxTime(uint32_t millis)
{
    _deepSleepMaxTime = millis;
}

uint32_t DeepSleep::DeepSleepParams_t::_deepSleepMaxTime = 0;


// update remainingSleepTime and currentSleepTime
// both will be 0 when the last cycle has completed
void DeepSleep::DeepSleepParams_t::calcSleepTime()
{
    if (isUnlimited()) {
        remainingSleepTime = 0;
        currentSleepTime = 0;
        return;
    }
    // split sleep time up into ~3h cycles
    auto maxSleepTime = getDeepSleepMaxMillis();

    if (remainingSleepTime) {
        if (remainingSleepTime > maxSleepTime * 2) {
            // use max. sleep time
            remainingSleepTime -= maxSleepTime;
            currentSleepTime = maxSleepTime;
        }
        else if (remainingSleepTime < maxSleepTime) {
            // wait for the remaining time
            currentSleepTime = remainingSleepTime;
            remainingSleepTime = 0;
        }
        else {
            // split 50:50
            remainingSleepTime = maxSleepTime / 2;
            currentSleepTime = remainingSleepTime;
        }
    }
    else {
        currentSleepTime = 0;
    }
    ::printf(PSTR("deep sleep cycle: time=%ums rest=%ums total=%ums max=%u/%.0f\n"), currentSleepTime, remainingSleepTime, deepSleepTime, maxSleepTime, ESP.deepSleepMax() / 1000.0);

}

void KFCFWConfiguration::wakeUpFromDeepSleep()
{
    ::printf(PSTR("wakeUpFromDeepSleep\n"));

    BUILDIN_LED_SET(BlinkLEDTimer::BlinkType::FLICKER);

    if (RTCMemoryManager::read(RTCMemoryManager::RTCMemoryId::DEEP_SLEEP, &_deepSleepParams, sizeof(_deepSleepParams)) && _deepSleepParams.deepSleepTime) {
        if (_deepSleepParams.remainingSleepTime) {
            _deepSleepParams.calcSleepTime();

#if RTC_SUPPORT
            _deepSleepParams.lastWakeUpUnixTime = getRTC();
#endif

#if IOT_REMOTE_CONTROL
            auto state = RemoteControlPlugin::getInstance().readPinState();

            if (state.anyPressed() && _deepSleepParams.abortOnKeyPress) {
                _deepSleepParams.abortCycles();
            }
#endif

            uint32_t ms = micros();
            _deepSleepParams.cycleRuntime += ms + 3500;
            ::printf(PSTR("cycle_runtime=%uus last=%uus\n"), _deepSleepParams.cycleRuntime, ms);

            RTCMemoryManager::write(RTCMemoryManager::RTCMemoryId::DEEP_SLEEP, &_deepSleepParams, sizeof(_deepSleepParams));

            auto dur = micros() - ms;
            ::printf(PSTR("additional time: %u\n"), (unsigned)dur);

            if (_deepSleepParams.hasBeenAborted()) {
                // deep sleep aborted by a keypress
            }
            else if (_deepSleepParams.isUnlimited()) {
                ::printf(PSTR("entering deep sleep: %u\n"), 0);
                ESP.deepSleepInstant(0, _deepSleepParams.mode);
            }
            else if (!_deepSleepParams.cyclesCompeleted()) {

                if (_deepSleepParams.remainingSleepTime < 1000 && _deepSleepParams.mode != RFMode::RF_CAL) {
                    _deepSleepParams.mode = RFMode::RF_CAL;
                    ::printf(PSTR("running RF_CAL\n"));
                } else {
                    _deepSleepParams.mode = RFMode::RF_DISABLED;
                    ::printf(PSTR("running RF_DISABLED\n"));
                }

                ::printf(PSTR("entering deep sleep: %u\n"), _deepSleepParams.currentSleepTime);

                ESP.deepSleepInstant(_deepSleepParams.currentSleepTime * 1000ULL, _deepSleepParams.mode);
                ::printf(PSTR("entering deep sleep: %u\n"), 0);
                ESP.deepSleepInstant(0, _deepSleepParams.mode); // go to deep sleep indefinitely if the first call fails
            }
            else {
                ::printf(PSTR("executing full wakeup\n"));
            }
        }
        if (_deepSleepParams.tasks.connectWiFi == false) {
            ::printf(PSTR("wifi quick connect disabled\n"));
            return;
        }
    }
    else {
        _deepSleepParams = {};
    }

    wifiQuickConnect();
}

void KFCFWConfiguration::enterDeepSleep(milliseconds time, RFMode mode, uint16_t delayAfterPrepare)
{
    __DBG_printf("time=%d mode=%d delay_prep=%d", time.count(), mode, delayAfterPrepare);

#if RTC_SUPPORT
    _deepSleepParams.unixtime = getRTC();
#else
    time_t now = ::time(nullptr);
    if (IS_TIME_VALID(now)) {
        _deepSleepParams.unixtime = now;
    }
#endif

    // WiFiCallbacks::getVector().clear(); // disable WiFi callbacks to speed up shutdown
    // Scheduler.terminate(); // halt scheduler

    resetDetector.clearCounter();
    SaveCrash::removeCrashCounter();

    delay(1);
    uint32_t milliseconds = time.count();

    for(auto plugin: plugins) {
        plugin->prepareDeepSleep(milliseconds);
    }
    if (delayAfterPrepare) {
        delay(delayAfterPrepare);
    }
    __LDBG_printf("Entering deep sleep for %u milliseconds, RF mode %d", milliseconds, mode);

#if __LED_BUILTIN == NEOPIXEL_PIN_ID
    BUILDIN_LED_SET(BlinkLEDTimer::BlinkType::OFF);
#endif

#if defined(ESP8266)
    _deepSleepParams = DeepSleep::DeepSleepParams_t(milliseconds, mode);
    RTCMemoryManager::write(RTCMemoryManager::RTCMemoryId::DEEP_SLEEP, &_deepSleepParams, sizeof(_deepSleepParams));

    ESP.deepSleep(_deepSleepParams.getSleepTimeMicros(), mode);
    // try again with half of the max. time if first call fails
    PrintString tmp = F("Deep sleep failed with time_us=");
    tmp.print(_deepSleepParams.getSleepTimeMicros());
    Logger_error(tmp);
    ESP.deepSleep(ESP.deepSleepMax() / 2, mode);
    // go to deep sleep indefinitely
    ESP.deepSleep(0, mode);
#else
    ESP.deepSleep(time.count() * 1000UL);
    ESP.deepSleep(0);
#endif
}

#endif

static void invoke_ESP_restart()
{
#if __LED_BUILTIN == NEOPIXEL_PIN_ID
    BlinkLEDTimer::setBlink(__LED_BUILTIN, BlinkLEDTimer::OFF);
#endif
    ESP.restart();
}

#if PIN_MONITOR
#include "pin_monitor.h"
#endif

void KFCFWConfiguration::restartDevice(bool safeMode)
{
    __LDBG_println();

// enable debugging output (::printf) for shutdown sequence
#define DEBUG_SHUTDOWN_SEQUENCE DEBUG

    String msg = F("Device is being restarted");
    if (safeMode) {
        msg += F(" in SAFE MODE");
    }
    Logger_notice(msg);
    BUILDIN_LED_SET(BlinkLEDTimer::BlinkType::FLICKER);

