sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
    delay(500);

    SaveCrash::removeCrashCounterAndSafeMode();
    resetDetector.setSafeMode(safeMode);
    if (_safeMode) {
#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("safe mode: invoking restart\n"));
#endif
        invoke_ESP_restart();
    }

    // clear queue silently
    ADCManager::terminate(false);

#if HTTP2SERIAL_SUPPORT
#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("terminating http2serial instance\n"));
#endif
    Http2Serial::destroyInstance();
#endif

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("scheduled tasks %u, WiFi callbacks %u, Loop Functions %u\n"), _Scheduler.size(), WiFiCallbacks::getVector().size(), LoopFunctions::size());
#endif

    auto webUiSocket = WsWebUISocket::getServerSocket();
    if (webUiSocket) {
#if DEBUG_SHUTDOWN_SEQUENCE
        ::printf(PSTR("terminating webui websocket=%p\n"), webUiSocket);
#endif
        webUiSocket->shutdown();
    }

    // execute in reverse order
    for(auto iterator = plugins.rbegin(); iterator != plugins.rend(); ++iterator) {
        const auto plugin = *iterator;
#if DEBUG_SHUTDOWN_SEQUENCE
        ::printf(PSTR("shutdown plugin=%s\n"), plugin->getName_P());
#endif
        plugin->shutdown();
        plugin->clearSetupTime();
    }

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("scheduled tasks %u, WiFi callbacks %u, Loop Functions %u\n"), _Scheduler.size(), WiFiCallbacks::getVector().size(), LoopFunctions::size());
#endif

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("terminating pin monitor\n"));
#endif
#if PIN_MONITOR
    pinMonitor.end();
#endif

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("terminating serial handlers\n"));
#endif
    serialHandler.end();
#if DEBUG
    debugStreamWrapper.clear();
#endif

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("clearing wifi callbacks\n"));
#endif
    WiFiCallbacks::clear();

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("clearing loop functions\n"));
#endif
    LoopFunctions::clear();

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("terminating event scheduler\n"));
#endif
    __Scheduler.end();

#if DEBUG_SHUTDOWN_SEQUENCE
    ::printf(PSTR("invoking restart\n"));
#endif
    invoke_ESP_restart();
}

void KFCFWConfiguration::loop()
{
    rng.loop();
    config.gc();
}

uint8_t KFCFWConfiguration::getMaxWiFiChannels()
{
    wifi_country_t country;
    if (!wifi_get_country(&country)) {
        country.nchan = 255;
    }
    return country.nchan;
}

const __FlashStringHelper *KFCFWConfiguration::getWiFiEncryptionType(uint8_t type)
{
#if defined(ESP32)
    switch(type) {
        case WIFI_AUTH_OPEN:
            return F("open");
        case WIFI_AUTH_WEP:
            return F("WEP");
        case WIFI_AUTH_WPA_PSK:
            return F("WPA/PSK");
        case WIFI_AUTH_WPA2_PSK:
            return F("WPA2/PSK");
        case WIFI_AUTH_WPA_WPA2_PSK:
            return F("WPA/WPA2/PSK");
        case WIFI_AUTH_WPA2_ENTERPRISE:
            return F("WPA2/ENTERPRISE");
    }
#elif defined(ESP8266)
    switch(type) {
        case ENC_TYPE_NONE:
            return F("open");
        case ENC_TYPE_WEP:
            return F("WEP");
        case ENC_TYPE_TKIP:
            return F("WPA/PSK");
        case ENC_TYPE_CCMP:
            return F("WPA2/PSK");
        case ENC_TYPE_AUTO:
            return F("auto");
    }
#endif
    return F("N/A");
}

bool KFCFWConfiguration::reconfigureWiFi()
{
    _debug_println();
    BOOTLOG_PRINTF("reconfigure WiFi");

    WiFi.persistent(false); // disable during disconnects since it saves the configuration
    WiFi.setAutoConnect(false);
    WiFi.setAutoReconnect(false);
    WiFi.disconnect(true);
    WiFi.softAPdisconnect(true);
    WiFi.persistent(true);

    return connectWiFi();
}

bool KFCFWConfiguration::connectWiFi()
{
    __LDBG_println();
    BOOTLOG_PRINTF("connecting to WiFi");
    setLastError(String());

    bool station_mode_success = false;
    bool ap_mode_success = false;

    auto flags = System::Flags::getConfig();
    if (flags.is_station_mode_enabled) {
        BOOTLOG_PRINTF("init station mode");
        __LDBG_print("init station mode");
        WiFi.setAutoConnect(false); // WiFi callbacks have to be installed first during boot
        WiFi.setAutoReconnect(true);

        auto network = Network::Settings::getConfig();

        bool result;
        if (flags.is_station_mode_dhcp_enabled) {
            result = WiFi.config((uint32_t)0, (uint32_t)0, (uint32_t)0, (uint32_t)0, (uint32_t)0);
        } else {
            result = WiFi.config(network.getLocalIp(), network.getGateway(), network.getSubnet(), network.getDns1(), network.getDns2());
        }
        if (!result) {
            PrintString message;
            message.printf_P(PSTR("Failed to configure Station Mode with %s"), flags.is_station_mode_dhcp_enabled ? PSTR("DHCP") : PSTR("static address"));
            setLastError(message);
            Logger_error(message);
        } else {

            if (WiFi.begin(Network::WiFi::getSSID(), Network::WiFi::getPassword()) == WL_CONNECT_FAILED) {
                String message = F("Failed to start Station Mode");
                setLastError(message);
                Logger_error(message);
            } else {
                __LDBG_printf("Station Mode SSID %s", Network::WiFi::getSSID());
                station_mode_success = true;
            }
        }
    }
    else {
        __LDBG_print("disabling station mode");
        WiFi.disconnect(true);
        station_mode_success = true;
    }

    if (flags.is_softap_enabled) {
        BOOTLOG_PRINTF("init AP mode");
        __LDBG_print("init AP mode");

        auto softAp = Network::SoftAP::getConfig();
        BOOTLOG_PRINTF("config=%p size=%u", &softAp, sizeof(softAp));

        BOOTLOG_PRINTF("WiFi.softAPConfig");
        if (!WiFi.softAPConfig(softAp.getAddress(), softAp.getGateway(), softAp.getSubnet())) {
            BOOTLOG_PRINTF("failed");
            String message = F("Cannot configure AP mode");
            setLastError(message);
            Logger_error(message);
        } else {

#if defined(ESP32)

